export let model = {
    roomId: 0,
    teams: [

    ],
    activeTeamIndex: null,
    round: 1,
    guessed: 0,
    skip: 0,
    winner: null,
}

export const modelExample = {
    teams: [
        {
            name: 'team1',
            score: 5,
            isWinner: false,
        },
        {
            name: 'team2',
            score: 7,
            isWinner: false,
        },

    ],
    active: 'team1',
    round: 5,
    guessed: 5,
    skip: 2,

}

export const aliasWords = [
    "парасолька", "валіза", "гаманець", "ліхтарик", "годинник",
    "радість", "дружба", "успіх", "щастя", "перемога",
    "чарівник", "привид", "скарб", "лабіринт", "таємниця",
    "кава", "шоколад", "морозиво", "печиво", "попкорн",
    "кактус", "тюльпан", "соняшник", "дуб", "виноград",
    "мікрофон", "камера", "навушники", "радіо", "телескоп",
    "карнавал", "подарунок", "вечірка", "сюрприз", "конфеті",
    "велетень", "казка", "мрія", "диво", "подорож",
    "авантюра", "експедиція", "детектив", "мандрівник", "легенда",
    "міф", "історія", "картина", "театр", "скульптура",
    "блискавка", "вулкан", "магніт", "ракета", "космос",
    "метелик", "бджола", "жук", "хамелеон", "черепаха",
    "дракон", "самурай", "лицар", "пірат", "робот",
    "пазл", "кросворд", "шахи", "вікторина", "ребус",
    "автобус", "мотоцикл", "трамвай", "корабель", "підводний човен",
    "дзеркало", "ключ", "замок", "сходи", "балкон",
    "весілля", "оркестр", "маскарад", "атракціон", "фестиваль",
    "мікрофон", "камера", "навушники", "радіо", "телескоп",
    "карнавал", "подарунок", "вечірка", "сюрприз", "конфеті",
    "велетень", "казка", "мрія", "диво", "подорож",
    "авантюра", "експедиція", "детектив", "мандрівник", "легенда",
    "міф", "історія", "картина", "театр", "скульптура",
];

export const usedWords = [

];

export function readStorage(){
    try {
        const savedData = JSON.parse(localStorage.getItem("room"));
        // const savedData = modelExample;

        if (savedData) {
            model = savedData;
        }else {
            console.log("Дані відсутні у localStorage.");
        }
    }catch (error){
        console.error("не можу дістати данні");
    }

}

export function saveModel(){
    localStorage.setItem("room", JSON.stringify(model));
    console.log(JSON.stringify(model));
}

readStorage();

